Reports/Renault_ТрафикВРазрезах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>Renault_ТрафикВРазрезах</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокДоступныхТиповГруппировки</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппировкаДиаграммы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоРасшифровка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДиаграммы</Name>
					<Type>
						<v8:Type>v8ui:ChartType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьДиаграмму</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатДиаграмма</Name>
					<Type>
						<v8:Type>mxl:SpreadsheetDocument</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьНастройки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Группировки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Поле</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипГруппировки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступныеПоляОтчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяПоля</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ресурс</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДополнительноеПоле</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.CRM_РеквизитыТрафика</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Предопределенное</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

Reports/Renault_ТрафикВРазрезах/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаКлиенте
Процедура ВыбратьПериод(Команда)
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();

	Диалог.Период.ДатаНачала    = Отчет.Период.ДатаНачала;
	Диалог.Период.ДатаОкончания = Отчет.Период.ДатаОкончания ;

	Если Диалог.Редактировать() Тогда
		Отчет.Период.ДатаНачала    = Диалог.Период.ДатаНачала;
		Отчет.Период.ДатаОкончания = Диалог.Период.ДатаОкончания;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоляГруппировки(СтруктураГруппировок)
	Если СтруктураГруппировок.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ЭлементСтруктуры Из СтруктураГруппировок Цикл
		Если ТипЗнч(ЭлементСтруктуры) = Тип("ГруппировкаКомпоновкиДанных") Тогда
			Для Каждого ЭлементПоляГруппировки Из ЭлементСтруктуры.ПоляГруппировки.Элементы Цикл
				НоваяСтрока = Отчет.Группировки.Добавить();
				НоваяСТрока.Поле = СокрЛП(ЭлементПоляГруппировки.Поле);
				Если ЭлементПоляГруппировки.ТипГруппировки=ТипГруппировкиКомпоновкиДанных.Иерархия Тогда
					НоваяСтрока.ТипГруппировки = "Иерархия";
				ИначеЕсли ЭлементПоляГруппировки.ТипГруппировки=ТипГруппировкиКомпоновкиДанных.ТолькоИерархия Тогда
					НоваяСтрока.ТипГруппировки = "ТолькоИерархия";
				Иначе
					НоваяСтрока.ТипГруппировки = "Элементы";
				КонецЕсли;
			КонецЦикла;
			
			Для Каждого полеВыбора Из ЭлементСтруктуры.Выбор.Элементы Цикл
				Если ТипЗнч(полеВыбора)=Тип("АвтоВыбранноеПолеКомпоновкиДанных") Тогда
					Продолжить;
				КонецЕсли;
				
				врОтбор = Новый Структура;
				врОтбор.Вставить("ИмяПоля", СокрЛП(полеВыбора.Поле)); 
				нСтроки = Отчет.ДоступныеПоляОтчета.НайтиСтроки(врОтбор);
				Для Каждого текСтрока Из нСтроки Цикл
					текСтрока.Пометка = Истина;
					
					// переместим текущую строку в начало таблицы
					врИндексПредыдущейСтроки = текСТрока.НомерСтроки-2;
					врИндексСтроки = текСТрока.НомерСтроки-1;
					Пока врИндексПредыдущейСтроки>=0 И Отчет.ДоступныеПоляОтчета[врИндексПредыдущейСтроки].Пометка=Ложь Цикл
						Отчет.ДоступныеПоляОтчета.Сдвинуть(врИндексСтроки, -1);
						
						врИндексПредыдущейСтроки = врИндексПредыдущейСтроки-1;
						врИндексСтроки = врИндексСтроки-1;
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
			
			Если ЭлементСтруктуры.Структура.Количество()>0 Тогда
				ЗаполнитьПоляГруппировки(ЭлементСтруктуры.Структура);
			КонецЕсли;
		ИначеЕсли ТипЗнч(ЭлементСтруктуры) = Тип("ДиаграммаКомпоновкиДанных") Тогда
			Для Каждого выбТочка Из ЭлементСтруктуры.Точки Цикл
				Для Каждого полеВыбора Из выбТочка.ПоляГруппировки.Элементы Цикл
					врОтбор = Новый Структура;
					врОтбор.Вставить("ИмяПоля", СокрЛП(полеВыбора.Поле)); 
					нСтроки = Отчет.ДоступныеПоляОтчета.НайтиСтроки(врОтбор);
					Для Каждого текСтрока Из нСтроки Цикл
						Если текСтрока.Ресурс=Ложь Тогда
							Отчет.ГруппировкаДиаграммы = полеВыбора.Поле;
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоляРесурсов(Настройки)
	Для Каждого ПолеРесурса Из Настройки.Выбор.Элементы Цикл
		Если ТипЗнч(ПолеРесурса)=Тип("АвтоВыбранноеПолеКомпоновкиДанных") Тогда
			Продолжить;
		КонецЕсли;
		
		врОтбор = Новый Структура;
		врОтбор.Вставить("ИмяПоля", СокрЛП(ПолеРесурса.Поле)); 
		нСтроки = Отчет.ДоступныеПоляОтчета.НайтиСтроки(врОтбор);
		Для Каждого текСтрока Из нСтроки Цикл
			текСтрока.Пометка = Истина;
			
			// переместим текущую строку в начало таблицы
			врИндексПредыдущейСтроки = текСТрока.НомерСтроки-2;
			врИндексСтроки = текСТрока.НомерСтроки-1;
			Пока врИндексПредыдущейСтроки>=0 И Отчет.ДоступныеПоляОтчета[врИндексПредыдущейСтроки].Пометка=Ложь Цикл
				Отчет.ДоступныеПоляОтчета.Сдвинуть(врИндексСтроки, -1);
				
				врИндексПредыдущейСтроки = врИндексПредыдущейСтроки-1;
				врИндексСтроки = врИндексСтроки-1;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСпискиВыбора(НастройкиОтчета)
	// список типов группировки
	Отчет.СписокДоступныхТиповГруппировки.Очистить();
	Отчет.СписокДоступныхТиповГруппировки.Добавить("Элементы");
	Отчет.СписокДоступныхТиповГруппировки.Добавить("Иерархия");
	Отчет.СписокДоступныхТиповГруппировки.Добавить("ТолькоИерархия");
	
	// список доступных полей
	Отчет.ДоступныеПоляОтчета.Очистить();
	
	ОсновнаяСхемаКомпоновкиДанных = РеквизитФормыВЗначение("Отчет").СхемаКомпоновкиДанных;
	
	// поля
	Для Каждого Набор Из ОсновнаяСхемаКомпоновкиДанных.НаборыДанных Цикл
		Для Каждого выбПоле Из Набор.Поля Цикл
			нСтрока = Отчет.ДоступныеПоляОтчета.Добавить();
			нСтрока.Пометка = Ложь;
			нСтрока.ИмяПоля = выбПоле.ПутьКДанным;
			нСтрока.Ресурс = Ложь;
			нСтрока.ДополнительноеПоле = ПланыВидовХарактеристик.CRM_РеквизитыТрафика.ПустаяСсылка();
			нСтрока.Предопределенное = Истина;
		КонецЦикла;		
	КонецЦикла;
	
	// вычисляемые поля
	Для Каждого вычисляемоеПоле Из ОсновнаяСхемаКомпоновкиДанных.ВычисляемыеПоля Цикл
		нСтрока = Отчет.ДоступныеПоляОтчета.Добавить();
		нСтрока.Пометка = Ложь;
		нСтрока.ИмяПоля = вычисляемоеПоле.ПутьКДанным;
		нСтрока.Ресурс = Ложь;
		нСтрока.ДополнительноеПоле = ПланыВидовХарактеристик.CRM_РеквизитыТрафика.ПустаяСсылка();
		нСтрока.Предопределенное = Истина;
	КонецЦикла;
	
	// ресурсы
	Для Каждого полеИтога Из ОсновнаяСхемаКомпоновкиДанных.ПоляИтога Цикл
		врОтбор = Новый СТруктура;
		врОтбор.Вставить("ИмяПоля",полеИтога.ПутьКДанным);
		МассивСтрок = Отчет.ДоступныеПоляОтчета.НайтиСтроки(врОтбор);
		Для Каждого текСтрока Из МассивСтрок Цикл
			текСтрока.Ресурс = Истина;
		КонецЦикла;
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИмяФормыОтчета = ИмяФормы;
	ОтчетОбъект      = РеквизитФормыВЗначение("Отчет");
	КлючОтчета       = ОтчетОбъект.Метаданные().ПолноеИмя();
	
	Отчет.Период.ДатаНачала = НачалоМесяца(ТекущаяДата());
	Отчет.Период.ДатаОкончания = КонецМесяца(ТекущаяДата());
	Отчет.ТипДиаграммы = ТипДиаграммы.КруговаяОбъемная;
	
	ЗагрузитьНастройкиФормы();
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Не Renault_РаботаСПравамиПользователя.ЕстьПравоОткрытияОтчетапродаж(ПараметрыСеанса.Пользователь,"Renault_ТрафикВРазрезах") тогда
		Сообщить("Недостаточно прав доступа.");
		СтандартнаяОбработка = Ложь;
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	// установим списки выбора для полей настроек отчета
	СписокДоступныхПолейГруппировки = Новый СписокЗначений;
	Для Каждого текСтрока Из Отчет.ДоступныеПоляОтчета Цикл
		Если текСТрока.Ресурс Тогда
			Продолжить;
		КонецЕсли;
		СписокДоступныхПолейГруппировки.Добавить(текСтрока.ИмяПоля);
	КонецЦикла;
	
	СписокДоступныхПолейГруппировки.СортироватьПоЗначению(НаправлениеСортировки.Возр);
	
	ЭтаФорма.Элементы.Группировки1ТипГруппировки.СписокВыбора.ЗагрузитьЗначения(Отчет.СписокДоступныхТиповГруппировки.ВыгрузитьЗначения());
	ЭтаФорма.Элементы.Группировки1Поле.СписокВыбора.ЗагрузитьЗначения(СписокДоступныхПолейГруппировки.ВыгрузитьЗначения());
	
	ЭтаФорма.Элементы.ГруппировкаДиаграммы.СписокВыбора.ЗагрузитьЗначения(СписокДоступныхПолейГруппировки.ВыгрузитьЗначения());
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;
	Возврат; // пока без расшифровки
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеВариантаНаСервере(Настройки)
	Отчет.Группировки.Очистить();
	ОбновитьСписокВариантовОтчета(КлючТекущегоВарианта);  
	ПараметрыКомпоновки = Новый Структура;
	
	// Добавление реквизитов для завязки на параметры данных
	Для Каждого ТекПараметр Из Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.ДоступныеПараметры.Элементы Цикл
		Если НЕ ТекПараметр.Видимость Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяПараметра = "Параметр"+Строка(ТекПараметр.Параметр);
		ПараметрыКомпоновки.Вставить(ИмяПараметра);
	КонецЦикла;

	Если Настройки<>Неопределено Тогда
		ЗаполнитьСпискиВыбора(Настройки);
		ЗаполнитьПоляГруппировки(Настройки.Структура);
		ЗаполнитьПоляРесурсов(Настройки);
		
		Отчет.РезультатДиаграмма.Очистить();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ОбновитьНастройкиСервер(идФормы)
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
    ОтчетОбъект.СформироватьСхемуКомпоновкиДанных();
	
	Попытка
		АдресСКД = ПоместитьВоВременноеХранилище(ОтчетОбъект.СхемаКомпоновкиДанных, идФормы);
	Исключение
		АдресСКД = Неопределено;
	КонецПопытки;
	
	Возврат АдресСКД;
КонецФункции

&НаКлиенте
Процедура ОбновитьНастройки()
	АдресСКД = ОбновитьНастройкиСервер(этаФорма.УникальныйИдентификатор);
	
	Если АдресСКД=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	источникДоступныхНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСКД);
	Отчет.КомпоновщикНастроек.Инициализировать(источникДоступныхНастроек);
КонецПроцедуры

&НаКлиенте
Процедура ДоступныеПоляОтчетаПередУдалением(Элемент, Отказ)
	
	Если Элемент.ТекущиеДанные.Предопределенное Тогда
		Отказ = Истина;
	Иначе
		// удалим поле из списков выбора
		имяПоля = Элемент.ТекущиеДанные.ИмяПоля;
		нЗначение = ЭтаФорма.Элементы.ГруппировкаДиаграммы.СписокВыбора.НайтиПоЗначению(имяПоля);
		Если нЗначение<>Неопределено Тогда
			ЭтаФорма.Элементы.ГруппировкаДиаграммы.СписокВыбора.Удалить(нЗначение);
		КонецЕсли;
		нЗначение = ЭтаФорма.Элементы.Группировки1Поле.СписокВыбора.НайтиПоЗначению(имяПоля);
		Если нЗначение<>Неопределено Тогда
			ЭтаФорма.Элементы.Группировки1Поле.СписокВыбора.Удалить(нЗначение);
		КонецЕсли;
		
		// удалим группировки
		нОтбор = Новый Структура;
		нОтбор.Вставить("Поле",имяПоля); 
		найденныеСтроки = Отчет.Группировки.НайтиСтроки(нОтбор);
		Для Каждого текСтрока Из найденныеСтроки Цикл
			Отчет.Группировки.Удалить(текСтрока);
		КонецЦикла;	
		
		// группировка диаграммы
		Если Отчет.ГруппировкаДиаграммы=имяПоля Тогда
			// заменим на первую группировку из списка группировок строк
			Если Отчет.Группировки.Количество()>0 Тогда
				Отчет.ГруппировкаДиаграммы = Отчет.Группировки[0].Поле;
			Иначе
				Отчет.ГруппировкаДиаграммы = "";
			КонецЕсли;
		КонецЕсли;
		
		// удалим поля из отбора
		массивДляУдаления = Новый Массив;
		Для Каждого текЭлемент Из Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
			Если СокрЛП(текЭлемент.ЛевоеЗначение)=имяПоля ИЛИ СокрЛП(текЭлемент.ПравоеЗначение)=имяПоля Тогда
				массивДляУдаления.Добавить(текЭлемент);				
			КонецЕсли;
		КонецЦикла;
		Если массивДляУдаления.Количество()>0 тогда
			Для Каждого текЭлемент Из массивДляУдаления Цикл
				Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Удалить(текЭлемент);
			КонецЦикла;			
		КонецЕсли;
		
		// удалим значения упорядочивания
		массивДляУдаления = Новый Массив;
		Для Каждого текЭлемент Из Отчет.КомпоновщикНастроек.Настройки.Порядок.Элементы Цикл
			Если СокрЛП(текЭлемент.Поле)=имяПоля Тогда
				массивДляУдаления.Добавить(текЭлемент);				
			КонецЕсли;
		КонецЦикла;
		Если массивДляУдаления.Количество()>0 тогда
			Для Каждого текЭлемент Из массивДляУдаления Цикл
				Отчет.КомпоновщикНастроек.Настройки.Порядок.Элементы.Удалить(текЭлемент);
			КонецЦикла;			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоступныеПоляОтчетаПослеУдаления(Элемент)
	ОбновитьНастройки();
КонецПроцедуры

&НаСервере
Функция ДобавитьДоступноеПолеСервер(выбЗначение)
	// вставим выбранное значение последним помеченным значением перед ресурсом
	// если значение уже существует, то переместим его и установим пометку
	
	идСтроки = "";
	
	врОтбор = Новый Структура;
	врОтбор.Вставить("ДополнительноеПоле", выбЗначение);
	нСтроки = Отчет.ДоступныеПоляОтчета.НайтиСтроки(врОтбор);
	Если нСтроки.Количество()=0 Тогда
		индексСтрокиДляВставки = Неопределено;
		
		Для Каждого текСтрока Из Отчет.ДоступныеПоляОтчета Цикл
			Если текСтрока.Пометка=Ложь ИЛИ (текСтрока.Пометка И текСтрока.Ресурс) Тогда
				индексСтрокиДляВставки = текСтрока.НомерСтроки-1;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если индексСтрокиДляВставки=Неопределено Тогда
			// все строки помечены, добавляем в конец списка
			нСтрока = Отчет.ДоступныеПоляОтчета.Добавить();
		Иначе
			нСтрока = Отчет.ДоступныеПоляОтчета.Вставить(индексСтрокиДляВставки);
		КонецЕсли;
		
		нСтрока.Пометка = Истина;
		нСтрока.ИмяПоля = выбЗначение.Наименование;
		нСтрока.Ресурс = Ложь;
		нСтрока.ДополнительноеПоле = выбЗначение.Ссылка;
		нСтрока.Предопределенное = Ложь;
		
		идСтроки = нСтрока.ПолучитьИдентификатор();
	Иначе
		Для Каждого текСтрока Из нСтроки Цикл
			Если текСтрока.Пометка Тогда
				Продолжить;
			КонецЕсли;
			
			текСтрока.Пометка = Истина;
			
			// переместим текущую строку в начало таблицы
			врИндексПредыдущейСтроки = текСТрока.НомерСтроки-2;
			врИндексСтроки = текСТрока.НомерСтроки-1;
			Пока врИндексПредыдущейСтроки>=0 И (Отчет.ДоступныеПоляОтчета[врИндексПредыдущейСтроки].Пометка=Ложь ИЛИ Отчет.ДоступныеПоляОтчета[врИндексПредыдущейСтроки].Ресурс) Цикл
				Отчет.ДоступныеПоляОтчета.Сдвинуть(врИндексСтроки, -1);
				
				врИндексПредыдущейСтроки = врИндексПредыдущейСтроки-1;
				врИндексСтроки = врИндексСтроки-1;
			КонецЦикла;
		КонецЦикла;
		
		идСтроки = текСтрока.ПолучитьИдентификатор();
	КонецЕсли;
	
	Возврат идСтроки;
КонецФункции

&НаКлиенте
Процедура ДобавитьДоступноеПоле(Команда)
	
	выбЗначение = "";
	Если ВвестиЗначение(выбЗначение,"Выберите дополнительное поле",Тип("ПланВидовХарактеристикСсылка.CRM_РеквизитыТрафика")) Тогда
		Если выбЗначение=Неопределено ИЛИ выбЗначение.Пустая() ИЛИ выбЗначение.ЭтоГруппа Тогда
			Возврат;
		КонецЕсли;
		
		ЭтаФорма.Элементы.ДоступныеПоляОтчета.ТекущаяСтрока = ДобавитьДоступноеПолеСервер(выбЗначение);
		
		// добавим это поле в списки выбора группировок
		Если ЭтаФорма.Элементы.ГруппировкаДиаграммы.СписокВыбора.НайтиПоЗначению(выбЗначение.Наименование)=Неопределено Тогда
			ЭтаФорма.Элементы.ГруппировкаДиаграммы.СписокВыбора.Добавить(выбЗначение.Наименование);
		КонецЕсли;
		Если ЭтаФорма.Элементы.Группировки1Поле.СписокВыбора.НайтиПоЗначению(выбЗначение.Наименование)=Неопределено Тогда
			ЭтаФорма.Элементы.Группировки1Поле.СписокВыбора.Добавить(выбЗначение.Наименование);
		КонецЕсли;
		
		// обновим настройки
	    ОбновитьНастройки();
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура РезультатДиаграммаОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;
	Возврат; // пока без расшифровки
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокВариантовОтчета(КлючВарианта)
	
	СписокВыбора = Элементы.ТекстВариантНастройки.СписокВыбора;
	СписокВыбора.Очистить();
	
	СписокВариантов = ХранилищаНастроек.ХранилищеВариантовОтчетов.ПолучитьСписок(КлючОтчета);
	Для Каждого ТекЭлемент Из СписокВариантов Цикл
		Элементы.ТекстВариантНастройки.СписокВыбора.Добавить(ТекЭлемент.Значение, ТекЭлемент.Представление);
	КонецЦикла;
	
	ТекПозиция = Элементы.ТекстВариантНастройки.СписокВыбора.НайтиПоЗначению(КлючВарианта);
	Если НЕ ТекПозиция = Неопределено Тогда
		ЭтаФорма.КлючТекущегоВарианта  = ТекПозиция.Значение;
		ЭтаФорма.ТекстВариантНастройки = ТекПозиция.Представление;
	ИначеЕсли ЭтаФорма.ТекстВариантНастройки = "" Тогда
		Если Элементы.ТекстВариантНастройки.СписокВыбора.Количество()>0 Тогда
			ТекПозиция = Элементы.ТекстВариантНастройки.СписокВыбора[0];
			ЭтаФорма.КлючТекущегоВарианта  = ТекПозиция.Значение;
			ЭтаФорма.ТекстВариантНастройки = ТекПозиция.Представление;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТекстВариантНастройкиНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекПозиция = Элемент.СписокВыбора.НайтиПоЗначению(ЭтаФорма.КлючТекущегоВарианта);
	ВыбранноеЗначение = ВыбратьИзСписка(Элемент.СписокВыбора, Элемент, ТекПозиция);
	Если НЕ ВыбранноеЗначение = Неопределено Тогда
		ЭтаФорма.КлючТекущегоВарианта          = ВыбранноеЗначение.Значение;
		ЭтаФорма.ТекстВариантНастройки         = ВыбранноеЗначение.Представление;
		ЭтаФорма.ПредставлениеТекущегоВарианта = ВыбранноеЗначение.Представление;
		ИзменитьВариантОтчета();
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьНастройку(Элемент, СтруктураНастроек, ИмяПоля)
	
	Если СтруктураНастроек.Свойство(ИмяПоля) Тогда
		Элемент = СтруктураНастроек[ИмяПоля];
	КонецЕсли;
	
КонецПроцедуры

// Процедура загружает настройки формы.
//
&НаСервере
Процедура ЗагрузитьНастройкиФормы()
	
	СтруктураНастроек = ХранилищеНастроекДанныхФорм.Загрузить(ИмяФормыОтчета, "СтруктураНастроек");
	Если ТипЗнч(СтруктураНастроек) = Тип("Структура") Тогда
		
		ЗаполнитьНастройку(ЭтаФорма.КлючТекущегоВарианта,  СтруктураНастроек, "КлючТекущегоВарианта");
		ЗаполнитьНастройку(ЭтаФорма.ТекстВариантНастройки, СтруктураНастроек, "ТекстВариантНастройки");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьВариантОтчета()
	//ПараметрыДанных = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных;
	//Для Каждого ТекПараметр Из ПараметрыКомпоновки Цикл
	//	ПараметрыКомпоновки.Вставить(ТекПараметр.Ключ, ЭтаФорма[ТекПараметр.Ключ]);
	//КонецЦикла;
	
	Настройки = ХранилищаНастроек.ХранилищеВариантовОтчетов.ПолучитьНастройки(ЭтаФорма.КлючОтчета, ЭтаФорма.КлючТекущегоВарианта);
	
	Если НЕ Настройки = Неопределено Тогда
		Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
		Для Каждого ТекПараметр Из ПараметрыКомпоновки Цикл
			ИмяПараметра = Сред(ТекПараметр.Ключ, 9);
			Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра(ИмяПараметра, ТекПараметр.Значение);
		КонецЦикла;
		
		СписокДоступныхПолейГруппировки = Новый СписокЗначений;
		Для Каждого текСтрока Из Отчет.КомпоновщикНастроек.Настройки.Структура Цикл
			Если текСТрока.Ресурс Тогда
				Продолжить;
			КонецЕсли;
			СписокДоступныхПолейГруппировки.Добавить(текСтрока.ИмяПоля);
		КонецЦикла;
		
		СписокДоступныхПолейГруппировки.СортироватьПоЗначению(НаправлениеСортировки.Возр);
		
		ЭтаФорма.Элементы.Группировки1ТипГруппировки.СписокВыбора.ЗагрузитьЗначения(Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляГруппировок.ВыгрузитьЗначения());
		ЭтаФорма.Элементы.Группировки1Поле.СписокВыбора.ЗагрузитьЗначения(СписокДоступныхПолейГруппировки.ВыгрузитьЗначения());
		
		ЭтаФорма.Элементы.ГруппировкаДиаграммы.СписокВыбора.ЗагрузитьЗначения(СписокДоступныхПолейГруппировки.ВыгрузитьЗначения());

		//ЗначениеВРеквизитФормы(Отчет,"Отчет");
	КонецЕсли;
	
	ТекущийВариант = ХранилищаНастроек.ХранилищеВариантовОтчетов.ПолучитьВариантОтчета(ЭтаФорма.КлючОтчета, ЭтаФорма.КлючТекущегоВарианта);
	Если ТекущийВариант = Неопределено Тогда
		
	КонецЕсли;  
	
	//ЗаполнитьСпискиВыбора(Настройки);
	
КонецПроцедуры
